<article dir="rtl" class="leading-relaxed">
	<p>سلام! من جواد ادیب هستم</p>
	<p>بعد از آخرین تغییراتی که توسط گوگل اعمال شد، دسترسی به یوتیوب کیدز نیازمند یک لایه تغییر آی‌پی بیشتر بود و به همین دلیل سرعت دسترسی به اینترنت برای مشاهده ویدیو کاهش یافت و از آنجایی که راه‌حل‌های موجود هم به‌صورت موقتی بودند، به‌فکر یک راه‌حل سریع و دائم افتادم تا اینکه نیوتیوب متولد شد.</p>

	<h2 class="text-xl font-bold mb-2 mt-5">مشکل و راه‌حل</h2>
	<p class="mb-4">🆘 سوال این بود که چرا برای مشاهده ویدیو کودک من باید دسترسی دائم به اینترنت همراه با وی‌پی‌ان داشته باشه؟</p>
	<p class="mb-6">✅ راه‌حل ساده بود. ویدیوها رو دانلود می‌کنیم و روی سیستم خودمون میزاریم و میتونیم با بهترین کیفیت 1080 و شاید حتی با امکانات بهتری نسبت به یوتیوب کیدز اون رو نمایش بدیم.</p>

	<p class="mb-6">ممکنه سوال براتون پیش بیاد که مثلا چه امکانات بیشتری نسبت به یوتیوب کیدز؟ همین امروز قبل از شروع به کار دیدم که نورا خانوم ما در حال مشاهده کارتونی به زبان آلمانی بود! یا قبلا زبان تایلندی و اسپانیایی دیده بودم! خودش سرچ کرده بود اولیش رو آورده بود و بقیه رو هم الگوریتم گوگل بهش مشابه اون زبان پیشنهاد داده بود. یا مثلا دسته‌بندی موضوعی. بیبی جان یکی از اون سری فیلم‌هاست که هر از چند گاهی باید سرچ کنیم تا فیلم‌هاش رو پیدا کنیم و برای این هم راه‌حل مشخصی جز سرچ عمومی نیست.</p>


	<p>نیوتیوب یک یوتیوب شخصی و <a target="_blank" class="text-cyan-600" href="https://github.com/MrJavadAdib/newtube">پروژه منبع‌باز بر روی گیت‌هاب</a> هست که شما هم درصورت تمایل می‌تونید در اون مشارکت کنید و امکانات جدیدی بهش اضافه کنید. این پروژه از زبان PHP استفاده میکنه و دیتابیس نداره و با فایل کارهاش رو انجام میده.</p>
	<div dir="ltr"><a target="_blank" href="https://github.com/MrJavadAdib/newtube">https://github.com/MrJavadAdib/newtube</a></div>


	<h3 class="text-xl font-bold mb-2 mt-5">لیست امکانات پروژه نیوتیوب</h3>
	<ul class="list-disc list-inside">
		<li>نمایش لیست فیلم‌ها به‌صورت تصادفی</li>
		<li>دیزاین مناسب نمایش فیلم</li>
		<li>قابلیت دسته‌بندی از پیش‌تعریف شده</li>
		<li>قابلیت تعریف دسته‌بندی از طریق اسم فایل</li>
		<li>پخش خودکار  ویدیوی بعدی پس از اتمام ویدیوی فعلی</li>
		<li>امکان دانلود خودکار از یوتیوب با داشتن لینک ویدیو <a href="<?php echo getUrl_wo_params(); ?>?import" class="text-gray-600 rounded hover:bg-gray-200 hover:text-gray-700 transition-colors duration-300">اضافه کن</a></li>
		<li>دسته‌بندی موضوعی فیلم‌ها</li>
	</ul>

</article>